<?php

return [
    'WEEK_SHORT_NAME' => ['日','月','火', '水', '木', '金', '土'],

    'CENTRAL_BAMEI_CODE' => ['01', '02', '03', '04', '05', '06', '07', '08', '09', '10'],
    'REGION_BAMEI_CODE' => ['30', '35', '36', '42', '43', '44', '45', '46', '47', '48', '50', '51', '54', '55', '65'],
    'BAMEI_NAME' => [
        '01' => '札幌'
        ,'02' => '函館'
        ,'03' => '福島'
        ,'04' => '新潟'
        ,'05' => '東京'
        ,'06' => '中山'
        ,'07' => '中京'
        ,'08' => '京都'
        ,'09' => '阪神'
        ,'10' => '小倉'

        ,'30' => '門別'
        ,'35' => '盛岡'
        ,'36' => '水沢'
        ,'42' => '浦和'
        ,'43' => '船橋'
        ,'44' => '大井'
        ,'45' => '川崎'
        ,'46' => '金沢'
        ,'47' => '笠松'
        ,'48' => '名古屋'
        ,'50' => '園田'
        ,'51' => '姫路'
        ,'54' => '高知'
        ,'55' => '佐賀'
        ,'65' => '帯広(ば)'
    ],
    'REGION_TRACK_ID' => [
        '30' => 'monbetsu'
        ,'35' => 'morioka'
        ,'36' => 'mizusawa'
        ,'42' => 'urawa'
        ,'43' => 'funabashi'
        ,'44' => 'ooi'
        ,'45' => 'kawasaki'
        ,'46' => 'kanazawa'
        ,'47' => 'kasamatsu'
        ,'48' => 'nagoya'
        ,'50' => 'sonoda'
        ,'51' => 'himeji'
        ,'54' => 'kouchi'
        ,'55' => 'saga'
        ,'65' => 'obihiro'
    ],

    'GROUND_NAME' => ['','芝','ダート','障害'],
    'GROUND_SHORT_NAME' => ['','芝','ダ','障'],
    'DIRECTION_NAME' => ['','左','右'],

    'BABA_MEMO' => [
        '05' => [
            'd1300' => '脚質は先行、差し。スタート後に上りがあるためペースはさほど速くならず平均的に速い流れで直線に入る。1200mで強いスプリンタータイプの好走が目立ち、先行力のあるスピードタイプが雪崩れ込む競馬が多い。',
            'd1400' => '脚質は先行、差し。スタートからダートを走るコース、最初のコーナーまでは442mあり下りの直線距離が長いため前半のペースはかなり速くなる。',
            'd1600' => '脚質は先行、差し。外枠が有利とされるが出遅れは致命的。最初のコーナーまでの距離はおよそ640mと長いがスローペースになることは少ない。基本的には逃げ・先行が有利だが1300m、1400mに比べると逃げ切りの割合は少ない。',
            's1400' => '脚質は先行、差し。1400mという距離のわりにハイペースになりにくい。やや遅めの平均ペースの競馬が多い。各馬が余力を持って直線に入り上がりの勝負になりやすい。スプリンターよりも決め手のあるマイラーが強く、速い上がりが使えれば位置取りは問わない。',
            's1600' => '脚質は先行、差し。スタートして2コーナーまでの距離はおよそ160m。3コーナーまで距離があり先行争いはさほど激しくならない。速い上がりを求められるため先行力だけでは直線で切れ負けする。能力差が反映されるコースで人気馬の信頼度は高い。',
            's2400' => '脚質は先行、差し。基本的には長距離戦とあって、スローペースからの瞬発力勝負になることが多いのだが、逃げ馬のペースによって勝ち馬の脚質は様々。チャンピオンを決するコースらしく、スピード、スタミナがバランス良く求められ、逃げ切りは難しい。',
        ],
        '06' => [
            's1200' => '坂の頂上部分からスタート。最初のコーナーまでの距離は275mと短いが、3コーナーのカーブが緩く、ゴール前坂下までおよそ4.5mを一気に下っていく。最後の直線はローカル場並の310mと短く、最後に急勾配が待ち受ける。直線が短いため基本は先行馬有利だが、オーバーペースで先行した馬は急坂で脚が止まり差し馬の餌食となる。枠は中枠の数字が良いが下り坂を一気に駆け下りてくるため、4コーナーで馬群が外に振られることもあり。',
            's1600' => '高低差が5.3mあり、スタートは最高地点で4コーナーに向かって約4.5m下っていくほぼ下りのコース。最初の2コーナーまでの距離が240mと短いため、外枠に入った馬は不利。直線入り口でのポジションが大きく反映される。下りをスムーズに回ってきた逃げ、先行馬が勢いそのままになだれ込むパターンが多いが、ゴール前の急坂も忘れてはならないポイントで、オーバーペースで坂を迎えた馬は差し馬の餌食となってしまう。',
            's1800' => 'スタンド前の直線半ばからスタート。最初のコーナーまでが205mと短く、スタート後すぐに急坂を上がるため、極端に速いペースにはなりにくい。従ってスンナリと前のポジションを取った馬が有利で、逃げ、先行馬の成績がいい。コーナーを4つ回るため、外々を回らされるとその分ロスが大きくなって厳しくなる。上がりの平均タイムがクラス別で大きな差がなく、上がりの競馬にはなりにくい。前半から中盤のペースが勝ちタイムの差となって出てくる。',
            's2000' => '最初のコーナーまで405mで激しい先行争いが起きる傾向にある。ただし1コーナーを過ぎると落ち着くためペースはさほど速くはならない。脚質的には先行馬が強く、更に後半は長くいい脚が求められる。ゴール前の急坂を2度超えるため、タフさも要求される。また、マクリがハマり易いのも特色である。',
            's2200' => '1コーナーまでの直線距離は432m。緩やかなカーブを通るため平均ペースになりやすい。向こう正面の下りで道中のペースが落ちないため、3コーナーからの仕掛けが重要なポイント。脚質的には先行馬が有利。最後の直線は310mと短いがクラスが上がるにつれて逃げ切りは難しくなる。末脚の持続性、すなわちスタミナと底力が要求される。1度このコースで好走を見せた馬は要注意。',
            's2500' => '有馬記念が行われる舞台。外回りの3コーナーからスタートし、最初の4コーナーまでの距離は192m。スタンド前の直線を2度通過する。道中はゆったりと流れることも多く、残り1000mあたりからは非常に激しい攻防となる。ジョッキーの仕掛けが勝負の分かれ目となる。コーナーを6つ回るため、ロスなく立ち回れる先行馬が有利。スタミナと底力が要求される。このコースでの好走歴はもちろん、ローカルの2200m、2600mで好走実績を持つ馬も要注意。',
            's2600' => '',
            's3200' => '',
            's3600' => '',
            's4000' => '',
            'd1000' => '',
            'd1200' => '展開の見極めが重要なコース。逃げ先行馬が有利だが、ペースが速すぎると直線で止まることもある。外枠は芝コースを長く走れるが内枠でもダッシュ力があれば有利となる。',
            'd1700' => '',
            'd1800' => '逃げ、先行馬が圧倒的に有利。スタート直後から急坂を駆け上がり、向こう正面は下り坂。3～4コーナーを回って再び直線の急坂となる非常にタフなコース。砂が深いことも相まって最後は我慢比べとなる。スピードよりもバテないパワーが要求される。',
            'd2400' => '最初のコーナーまでの距離は209mで、高低差4.4mのタフな中山コースをおよそ1周半するためスタミナが問われる。施行条件は古馬500万と1000万クラスの2つ。脚質は他の中山ダートコース同様、前へ行く馬が有利。特殊な施行条件という事もあり、リピーターもよく見られる。好走歴がある馬は要注意。',
            'd2500' => '',
        ],
        '42' => [
            'd800' => '外枠がやや有利',
            'd1300' => '内枠が有利',
            'd1400' => '内枠がやや有利',
            'd1500' => '真ん中から外枠がやや有利',
            'd1600' => '内枠が断然有利',
            'd1900' => '内枠がやや有利',
            'd2000' => '枠順による有利不利はない'
        ],
        '43' => [
            'd1000' => 'スタート五部なら内枠が有利',
            'd1200' => '枠順による有利不利はない',
            'd1400' => '内枠がやや不利、先行馬は有利',
            'd1500' => '内枠がやや有利',
            'd1600' => '枠順による有利不利はない',
            'd1700' => '枠順による有利不利はない',
            'd1800' => '枠順による有利不利はない',
            'd2000' => '内枠がやや有利',
            'd2400' => '枠順による有利不利はない'
        ],
        '44' => [
            'd1000' => '内枠が断然有利',
            'd1200' => '内枠の逃げ馬は有利。速いスタートから前に行ける馬（先行、逃げ）、持続的なスピード＆パワータイプ、内〜中枠の先行馬を重視、差し馬（展開次第）',
            'd1400' => '内枠が断然有利。先行〜好位で運べる馬、スピード持続力のある馬、逃げ馬、差し脚の鋭い馬（展開次第）',
            'd1500' => '内枠の先行馬は有利',
            'd1600' => '内枠がやや有利。先行ポジションを取れるかが重要、ペースが落ち着いた場合に追込みでも届くケースあり',
            'd1700' => '内枠が有利、外枠の先行馬は不利',
            'd1800' => '枠順による有利不利はない',
            'd2000' => '枠順による有利不利はない',
            'd2400' => '内枠が断然有利',
            'd2600' => 'スタミナ適性重視、駆け引き重視'
        ],
        '45' => [
            'd900' => '内枠が有利',
            'd1400' => '内枠の先行馬は有利',
            'd1500' => '内枠がやや有利',
            'd1600' => '枠順による有利不利はない',
            'd2000' => '内枠が有利',
            'd2100' => '枠順による有利不利はない'
        ]
    ],

    'RACE_CLASS_RANK' => [
        'G1' => 1,
        'G2' => 2,
        'G3' => 3,
        'リステッド' => 4,
        'オープン' => 5,
        '３勝クラス' => 6,
        '２勝クラス' => 7,
        '１勝クラス' => 8,
        '未勝利' => 9,
    ],


    'LOGIN_USER' => '72309c04a625438463229aee18f3d336b34ce46b1663cb294620b747d0e08147',
    'LOGIN_PASS' => '00addb6bb85a52346e8f93f32644a17cd3e9e273b01cd097c9e51845c9896594',

    'SESSION_LOGIN_USER_NO' => 'LOGIN_USER_NO',
    'SESSION_LOGIN_USER_NAME' => 'LOGIN_USER_NAME',
    'SESSION_ADMIN' => 'ADMIN_USER',

    'JRA_MOVIE_PAGE' => 'https://www.jra.go.jp/error/error013.html?raceid={raceid}',
    'REGION_MOVIE_PAGE' => 'https://keiba-lv-st.jp/movie/player?track={track}&date={date}&race={raceno}',

    'SYSTEM_MSG' => 'system_msg',


    'default' => env('CACHE_DRIVER', 'file')
];
